# NetworkDefaultToPressure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..NetworkDefaultToPressure Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The network uses the default pressure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NetworkDefaultToPressure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NetworkDefaultToPressure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NetworkDefaultToPressure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace